# FlexibleInstanceFlip Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FlexibleInstanceFlip Property
ParameterTypeId Class See Also
---
"Flip"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FlexibleInstanceFlip { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FlexibleInstanceFlip As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FlexibleInstanceFlip {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace